## Условия домашки

---
### Задача 1
Представьте, что вы работаете в небольшой компании. Данные сотрудников хранятся в неструктурированном формате. Бухгалтерия попросила написать программу, в которой  можно работать с Ф. И. О. сотрудников.

Напишите четыре строки:

1. С именем
```firstName```
— для хранения имени.
1. С именем
```middleName```
— для хранения отчества.
1. С именем
```lastName```
— для хранения фамилии.
1. С именем
```fullName```
— для хранения Ф. И. О. сотрудника в формате «Фамилия Имя Отчество».

Выведите в консоль фразу: «Ф. И. О. сотрудника — …».

В качестве данных для задачи используйте Ivanov Ivan Ivanovich.
<details>
  <summary>Критерии оценки</summary>

- Инициализировали строки верно.
- Сложение строк провели корректно.
- При изменении данных в строках результат программы выводится корректно.
- Все условия задания выполнили.
</details>

---
### Задача 2
Для ежемесячного отчета и ведения документации бухгалтерии нужны Ф. И. О. сотрудников, полностью написанные заглавными буквами (верхним регистром).

Напишите программу, которая изменит написание Ф. И. О. сотрудника с Ivanov Ivan Ivanovich на полностью заглавные буквы.

В качестве строки с исходными данными используйте строку
fullName
.

Результат программы выведите в консоль в формате: «Данные Ф. И. О. сотрудника для заполнения отчета — …».
<details>
  <summary>Подсказка</summary>

Для решения задачи используйте метод 
```toUpperCase()```
. Этот метод преобразует все знаки в строке в верхний регистр.

Пример работы метода:
```
String small = "abcd";
System.out.println(small.toUpperCase());
```
Результат в консоли:
```
ABCD
```
Подробнее о работе метода
```toUpperCase()```
читайте в шпаргалке.
</details>
<details>
  <summary>Критерии оценки</summary>

- Применили метод, меняющий регистр символов строки.
- При изменении содержания строки результат программы выполняется.
- Результат программы вывели в консоль согласно условиям задачи.
</details>

---
### Задача 3
Система, в которой мы работаем, не принимает символ «ё». Напишите программу, которая заменяет символ «ё» на символ «е».

В качестве исходных данных используйте строку
```fullName```
и данные в ней — «Иванов Семён Семёнович».

Выведите результат программы в консоль в формате: «Данные Ф. И. О. сотрудника — ...».
<details>
  <summary>Критерии оценки</summary>

- Применили метод, меняющий написание данных строки.
- При изменении содержания строки результат программы выполняется.
- Результат программы вывели в консоль согласно условиям задачи.
</details>